import React from 'react';

const Blogs = () => {
  return (
    <div className="container">
      <h1 className='heading my-3'>BLOGS</h1>
      <div className="row g-3 my-4">
        <div className="col-12 border border-1 p-4 text-center shadow">
          <h3 className=' fw-bold'>জাভাস্ক্রিপ্ট(JavaScript) এবং নোড জেএস(Node Js) মধ্যে পার্থক্য ?</h3>
          <h6 className="fw-bold text-muted">
            JavaScript হল একটি সাধারণ প্রোগ্রামিং ভাষা যা যেকোনো ব্রাউজারে JavaScript ইঞ্জিন চালায়। নোড জেএস হল একটি জাভাস্ক্রিপ্ট প্রোগ্রামিং ভাষার জন্য একটি দোভাষী বা চলমান পরিবেশ যা অনেক অতিরিক্ত ধারণ করে । জাভাস্ক্রিপ্ট শুধুমাত্র ব্রাউজারে চালানো যেতে পারে।  নোড জেএস এর ​​সাহায্যে ব্রাউজারের বাইরে Javascript চালাতে পারি । জাভাস্ক্রিপ্ট ফ্রন্টএন্ড ডেভেলপমেন্টে ব্যবহার করা হয়। Nodejs সার্ভার-সাইড উন্নয়ন ব্যবহার করা হয় ।
          </h6>
        </div>
        <div className="col-12 border border-1 p-4 shadow text-center">
          <h3 className=' fw-bold'> SQL এবং NoSQL ডাটাবেসের মধ্যে পার্থক্য ? </h3>
          <h6 className="fw-bold text-muted">
            এসকিউএল(SQL) ডাটাবেসগুলি উল্লম্বভাবে স্কেলযোগ্য । নোএসকিউএল(NoSQL) ডেটাবেসগুলি অনুভূমিকভাবে স্কেলযোগ্য। এসকিউএল ডাটাবেসগুলি টেবিল-ভিত্তিক । নোএসকিউএল ডাটাবেসগুলি নথি, কী-মান, গ্রাফ, বা প্রশস্ত-কলাম স্টোর । SQL ডাটাবেস শ্রেণীবদ্ধ ডেটা সঞ্চয়ের জন্য উপযুক্ত নয়। NoSQL ডাটাবেসগুলি শ্রেণীবদ্ধ ডেটা সঞ্চয়ের জন্য সবচেয়ে উপযুক্ত। SQL ডাটাবেসের স্থির বা পূর্বনির্ধারিত স্কিমা আছে । NoSQL ডাটাবেসের গতিশীল স্কিমা আছে ।
          </h6>
        </div>
        <div className="col-12 border border-1 p-4 shadow text-center fw-bold">
          <h3 className=' fw-bold'>Jwt এর উদ্দেশ্য কি এবং এটি কিভাবে কাজ করে ? </h3>
          <h6 className="fw-bold text-muted">
            JWT, বা JSON ওয়েব টোকেন, একটি উন্মুক্ত মান যা দুটি পক্ষের মধ্যে নিরাপত্তা তথ্য ভাগ করার জন্য ব্যবহৃত হয় - একটি ক্লায়েন্ট এবং একটি সার্ভার। JWT অন্যান্য ওয়েব টোকেন থেকে আলাদা যে তারা দাবির একটি সেট ধারণ করে। দাবি দুটি পক্ষের মধ্যে তথ্য প্রেরণ করতে ব্যবহার করা হয়. এই দাবিগুলি কী তা নির্ভর করে হাতে থাকা ব্যবহারের ক্ষেত্রে।
            যে পক্ষ JWT তৈরি করে তারা শিরোনাম এবং পেলোডকে একটি গোপনীয়তার সাথে স্বাক্ষর করে যা ইস্যুকারী এবং প্রাপক উভয়ের কাছেই পরিচিত, অথবা শুধুমাত্র প্রেরকের কাছে পরিচিত একটি ব্যক্তিগত কী দিয়ে। যখন টোকেন ব্যবহার করা হয়, তখন গ্রহীতা পক্ষ যাচাই করে যে শিরোনাম এবং পেলোড স্বাক্ষরের সাথে মেলে
          </h6>
        </div>
      </div>
    </div>
  );
};

export default Blogs;